Repository: vitalikp/yum
Catalog: po/*.po
Languages: vi

source: Updating
vi: Đang cập nhật...

source: Erasing
vi: Đang tẩy

source: Installing
vi: Đang cài đặt

source: Obsoleted
vi: Đã lỗi thời

source: Updated
vi: Đã cập nhật

source: Erased
vi: Đã tẩy

source: Installed
vi: Đã cài

source: No header - huh?
vi: Hả - Không có đầu?

source: Repackage
vi: Đóng gói lại

source: Error: invalid output state: %s for %s
vi: Lỗi: trạng thái kết xuất không hợp lệ: %s cho %s

source: Erased: %s
vi: Đã tẩy: %s

source: Removing
vi: Đang gỡ bỏ...

source: Cleanup
vi: Làm sạch

source: Command "%s" already defined
vi: Lệnh "%s" đã được định nghĩa rồi

source: Setting up repositories
vi: Đang cài đặt kho chứa

source: Reading repository metadata in from local files
vi: Đang đọc siêu dữ liệu kho từ các tập tin nội bộ

source: Config error: %s
vi: Lỗi cấu hình: %s

source: Options error: %s
vi: Lỗi tùy-chọn: %s

source: Ignored option -q, -v, -d or -e (probably due to merging: -yq != -y -q)
vi: Lờ đi tùy chọn -q, -v, -d hay -e (gần như chắc chắn là vì hòa trộn: -yq != -y -q)

source: Ignored option -c (probably due to merging -yc != -y -c)
vi: Lờ đi tùy chọn -c (gần như chắc chắn là vì hòa trộn: -yc != -y -c)

source: Installed: %s-%s at %s
vi: Đã cài đặt : %s-%s lúc %s

source: Built : %s at %s
vi: Dịch : %s lúc %s

source: Committed: %s at %s
vi: Đã chuyển giao: %s lúc %s

source: You need to give some command
vi: Bạn cần đưa ra vài lệnh

source: No such command: %s. Please use %s --help
vi: Không có lệnh nào như thế: %s. Hãy xem “%s --help”

source: Repodata is over 2 weeks old. Install yum-cron? Or run: yum makecache fast
vi: Dữ liệu kho đã cũ hơn hai tuần. Cài yum-cron? Hoặc chạy: yum makecache fast

source: Disk Requirements:
vi: Các yêu cầu về đĩa:

source: At least %dMB more space needed on the %s filesystem.
vi: Cần ít nhất hơn %dMB trống còn lại trên hệ thống tập tin %s.

source: Error Summary -------------
vi: Tổng hợp lỗi ------------

source: Can't create lock file; exiting
vi: Không thể tạo khóa cho tập tin nên thoát ra

source: Another app is currently holding the yum lock; exiting as configured by exit_on_lock
vi: Ứng dụng khác hiện đang giữ hóa yum; thoát ra như là được cấu hình bằng exit_on_lock

source: d
vi: t

source: download
vi: tải về

source: downloadonly
vi: chỉ tải về

source: Is this ok [y/d/N]:
vi: Được chứ [y/d/N][c/t/K]:

source: Trying to run the transaction but nothing to do. Exiting.
vi: Đang thử chạy giao dịch nhưng không cần làm gì nên thoát.

source: future rpmdb ver mismatched saved transaction version,
vi: phiên bản rpmdb tương lai được ghi là phiên bản giao dịch,

source: ignoring, as requested.
vi: đang bãi bỏ như theo yêu cầu.

source: aborting.
vi: đang bãi bỏ.

source: Exiting on user command
vi: Thoát trên lệnh người dùng

source: Background downloading packages, then exiting:
vi: Tải về gói trên nền, sau đó thoát:

source: Downloading packages:
vi: Đang tải về các gói:

source: Error downloading packages:
vi: Gặp lỗi khi tải các gói về:

source: Running transaction check
vi: Đang chạy kiểm tra giao dịch

source: ERROR You need to update rpm to handle:
vi: LỖI Bạn cần cập nhật rpm để xử lý:

source: ERROR with transaction check vs depsolve:
vi: LỖI với kiểm tra và phân giải lại giao dịch.

source: RPM needs to be updated
vi: RPM cần được cập nhật

source: Please report this error in %s
vi: Vui lòng báo cáo lỗi này trong %s

source: Running transaction test
vi: Đang kiểm tra giao dịch

source: Transaction check error:
vi: Lỗi kiểm tra giao dịch:

source: Transaction test succeeded
vi: Kiểm tra giao dịch thành công

source: Running transaction
vi: Đang chạy giao dịch

source: Refusing to automatically import keys when running unattended. Use "-y" to override.
vi: Từ chối tự động nhập khóa khi chạy tự động. Dùng tùy chọn “-y” để đè lên.

source: * Maybe you meant:
vi: * Có phải ý bạn là:

source: Package(s) %s%s%s available, but not installed.
vi: Các gói %s%s%s sẵn có, nhưng lại chưa được cài đặt.

source: No package %s%s%s available.
vi: Không có gói %s%s%s sẵn có.

source: Bad %s argument %s.
vi: Đối số %s sai %s.

source: %d package to install
vi: %d gói được cài

source: Nothing to do
vi: Không cần làm gì

source: %d package marked for update
vi: %d gói được đánh dấu cần cập nhật

source: No packages marked for update
vi: Không có gói nào được đánh dấu cần cập nhật

source: %d package marked for distribution synchronization
vi: %d gói được đánh đấu cho đồng bộ hóa phân phối

source: No packages marked for distribution synchronization
vi: Chưa có gói nào được đánh đấu cho đồng bộ hóa phân phối

source: %d package marked for removal
vi: %d gói được đánh dấu là cần gỡ bỏ

source: No Packages marked for removal
vi: Không có gói nào được đánh dấu để gỡ bỏ

source: %d package to downgrade
vi: %d gói bị hạ cấp

source: (from %s)
vi: (từ %s)

source: Installed package %s%s%s%s not available.
vi: Gói đã cài %s%s%s%s không sẵn có.

source: %d package to reinstall
vi: %d gói được cài đặt lại

source: No packages provided
vi: Chưa đưa ra gói nào

source: Package(s) to install
vi: Các gói được cài

source: N/S matched: %s
vi: Khớp N/S: %s

source: Name and summary matches %sonly%s, use "search all" for everything.
vi: Tên và tổng thể khớp %schỉ%s, dùng "search all" cho mọi thứ.

source: Full name and summary matches %sonly%s, use "search all" for everything.
vi: Tên đầy đủ và tổng thể khớp %schỉ%s, dùng "search all" cho mọi thứ.

source: Matched: %s
vi: Đã khớp: %s

source: Name and summary matches %smostly%s, use "search all" for everything.
vi: Tên đầy đủ và tổng thể khớp %sphần lớn%s, dùng "search all" cho mọi thứ.

source: Warning: No matches found for: %s
vi: Cảnh báo: Không tìm thấy gì khớp cho: %s

source: No matches found
vi: Không tìm thấy kết quả nào khớp

source: Error: No packages found for: %s
vi: Lỗi: không tìm thấy các gói cho: %s

source: Cleaning repos:
vi: Đang dọn kho:

source: Cleaning up everything
vi: Đang dọn mọi thứ

source: Cleaning up headers
vi: Đang dọn phần đầu

source: Cleaning up packages
vi: Đang dọn các gói

source: Cleaning up xml metadata
vi: Đang dọn siêu dữ liệu xml

source: Cleaning up database cache
vi: Đang dọn bộ nhớ đệm cơ sở dữ liệu

source: Cleaning up expire-cache metadata
vi: Đang xóa siêu dữ liệu đệm hết hạn

source: Cleaning up cached rpmdb data
vi: Đang xóa dữ liệu rpmdb đã nhớ đệm

source: Cleaning up plugins
vi: Đang dọn phần bổ xung

source: Installed Environment Groups:
vi: Nhóm môi trường đã cài:

source: Available Environment Groups:
vi: Nhóm môi trường sẵn có:

source: Installed Groups:
vi: Các nhóm đã cài:

source: Installed Language Groups:
vi: Các nhóm ngôn ngữ đã cài:

source: Available Groups:
vi: Các nhóm sẵn có:

source: Available Language Groups:
vi: Các nhóm ngôn ngữ sẵn có:

source: Warning: no environments/groups match: %s
vi: Cảnh báo: không tìm thấy nhóm/môi-trường khớp: %s

source: Done
vi: Xong

source: Warning: group/environment %s does not exist.
vi: Cảnh báo: nhóm/biến “%s” không tồn tại.

source: Warning: Environment group %s does not exist.
vi: Cảnh báo: Nhóm biến môi trường “%s” không tồn tại.

source: Warning: Package group %s does not exist.
vi: Cảnh báo: Nhóm gói “%s” không tồn tại.

source: Warning: group %s does not exist.
vi: Cảnh báo: nhóm “%s” không tồn tại.

source: Maybe run: yum groups mark install (see man yum)
vi: Có lẽ nên chạy: yum groups mark install (xem trang hướng dẫn yum)

source: No packages in any requested group available to install or update
vi: Không có gói trong bất kỳ nhóm đã yêu cầu sẵn có để mà cài đặt hay nâng cấp

source: %d package to Install
vi: %d gói được cài đặt

source: No environment named %s exists
vi: Không có biến môi trường có tên %s

source: No group named %s exists
vi: Không có nhóm mang tên “%s”

source: Maybe run: yum groups mark remove (see man yum)
vi: Có lẽ nên chạy: yum groups mark remove (xem yum(1))

source: No packages to remove from groups
vi: Không có gói nào để gỡ bỏ từ các nhóm

source: %d package to remove
vi: %d gói được gỡ bỏ

source: Package %s is already installed, skipping
vi: Gói %s đã cài rồi, nên bỏ qua

source: Discarding non-comparable pkg %s.%s
vi: Loại bỏ pkg không thể so sánh %s.%s

source: No other %s installed, adding to list for potential install
vi: Không có %s khác được cài, thêm vào danh sách dành cho cài đặt tiềm năng

source: Plugin Options
vi: Tùy chọn cho phần bổ xung

source: Command line error: %s
vi: Lỗi dòng lệnh: %s

source: %s: %s option requires an argument
vi: %s: tùy chọn %s yêu cầu một tham số

source: --color takes one of: auto, always, never
vi: --color nhận một trong số: auto, always, never

source: --installroot must be an absolute path: %s
vi: --installroot phải là một đường dẫn tuyệt đối: %s

source: show this help message and exit
vi: hiển thị trợ giúp này rồi thoát

source: be tolerant of errors
vi: ngưỡng lỗi

source: run entirely from system cache, don't update cache
vi: chạy toàn bộ từ bộ nhớ đệm hệ thống, đừng cập nhật bộ nhớ đệm

source: config file location
vi: vị trí tập tin cấu hình

source: maximum command wait time
vi: thời gian chờ lệnh tối đa

source: debugging output level
vi: mức kết xuất thông tin gỡ lỗi

source: show duplicates, in repos, in list/search commands
vi: hiển thị trùng, trong kho, trong lệnh liệt kê hay tìm kiếm

source: error output level
vi: mức kết xuất lỗi

source: debugging output level for rpm
vi: mức xuất gỡ lỗi cho rpm

source: quiet operation
vi: thực hiện im lặng

source: verbose operation
vi: thực hiện có mô tả những gì đang làm

source: answer yes for all questions
vi: trả lời có cho mọi câu hỏi

source: answer no for all questions
vi: trả lời không cho mọi câu hỏi

source: show Yum version and exit
vi: hiển thị phiên bản của Yum rồi thoát

source: set install root
vi: đặt gốc cài đặt

source: enable one or more repositories (wildcards allowed)
vi: bật một hay nhiều kho (cho phép ký tự đại diện)

source: disable one or more repositories (wildcards allowed)
vi: tắt một hay nhiều kho (cho phép ký tự đại diện)

source: exclude package(s) by name or glob
vi: loại trừ các gói theo tên hay glob

source: disable exclude from main, for a repo or for everything
vi: tắt loại trừ từ phần chính, cho một hay mọi kho

source: disable includepkgs for a repo or for everything
vi: tắt “includepkgs” cho một kho hoặc mọi thứ

source: enable obsoletes processing during updates
vi: bật xử lý gói cũ khi cập nhật

source: disable Yum plugins
vi: tắt phần bổ xung cho Yum

source: disable gpg signature checking
vi: tắt chức năng xác thực chữ ký gpg

source: disable plugins by name
vi: tắt phần bổ xung theo tên

source: enable plugins by name
vi: bật phần bổ xung theo tên

source: skip packages with depsolving problems
vi: bỏ qua các gói để mà xử lý trục trặc

source: control whether color is used
vi: điều khiển khi nào thì tô màu

source: set value of $releasever in yum config and repo files
vi: đặt giá trị cho $releasever trong tập tin cấu hình kho yum

source: don't update, just download
vi: không cập nhật, chỉ tải về

source: specifies an alternate directory to store packages
vi: chỉ định một thư mục thay thế để lưu các gói

source: set arbitrary config and repo options
vi: đặt tùy chọn thuộc tính và kho cấu hình

source: Include bugfix relevant packages, in updates
vi: Bao gồm các gói liên quan đến sửa lỗi, vào cập nhật

source: Include security relevant packages, in updates
vi: Bao gồm các gói an ninh xác đáng, trong các cập nhật

source: Include packages needed to fix the given advisory, in updates
vi: Bao gồm các gói cần sửa lỗi tham vấn đã cho, vào cập nhật

source: Include packages needed to fix the given BZ, in updates
vi: Bao gồm các gói cần sửa lỗi do BZ đưa ra, vào cập nhật

source: Include packages needed to fix the given CVE, in updates
vi: Bao gồm các gói cần sửa lỗi do CVE đưa ra, vào cập nhật

source: Include security relevant packages matching the severity, in updates
vi: Bao gồm các gói an ninh dành cho dịch vụ máy chủ xác đáng, trong các cập nhật

source: Jan
vi: Th1

source: Feb
vi: Th2

source: Mar
vi: Th3

source: Apr
vi: Th4

source: May
vi: Th5

source: Jun
vi: Th6

source: Jul
vi: Th7

source: Aug
vi: Th8

source: Sep
vi: Th9

source: Oct
vi: Th10

source: Nov
vi: Th11

source: Dec
vi: Th12

source: Trying other mirror.
vi: Chọn máy bản sao khác.

source: Name : %s%s%s
vi: Tên : %s%s%s

source: Arch : %s
vi: Kiến trúc : %s

source: Epoch : %s
vi: Kỷ nguyên : %s

source: Version : %s
vi: Phiên bản : %s

source: Release : %s
vi: Phát hành : %s

source: Size : %s
vi: Kích thước : %s

source: Repo : %s
vi: Kho : %s

source: From repo : %s
vi: Từ kho : %s

source: Committer : %s
vi: Người gửi : %s

source: Committime : %s
vi: Thời gian gửi: %s

source: Buildtime : %s
vi: Thời điểm biên dịch: %s

source: Install time: %s
vi: Thời điểm cài: %s

source: Installed by: %s
vi: Được cài bởi: %s

source: Changed by : %s
vi: Thay đổi bởi: %s

source: Summary :
vi: Tổng hợp :

source: License :
vi: Giấy phép :

source: Description :
vi: Mô tả :

source: Is this ok [y/N]:
vi: Được chứ [y/N][c/K]:

source: y
vi: c

source: yes
vi: có

source: n
vi: k

source: no
vi: không

source: Group: %s
vi: Nhóm: %s

source: Group-Id: %s
vi: Id-Nhóm: %s

source: Description: %s
vi: Mô tả: %s

source: Language: %s
vi: Ngôn ngữ: %s

source: Mandatory Packages:
vi: Các gói bắt buộc:

source: Default Packages:
vi: Các gói mặc định:

source: Optional Packages:
vi: Các gói tùy chọn:

source: Conditional Packages:
vi: Các gói điều kiện:

source: Installed Packages:
vi: Các gói đã cài:

source: Environment Group: %s
vi: Nhóm biến môi-trường: %s

source: Environment-Id: %s
vi: Mã biến môi-trường: %s

source: Mandatory Groups:
vi: Nhóm theo yêu cầu:

source: Optional Groups:
vi: Các nhóm tùy chọn:

source: Installed Groups:
vi: Các nhóm đã cài:

source: package: %s
vi: gói : %s

source: No dependencies for this package
vi: Không có phần phụ thuộc cho gói này

source: dependency: %s
vi: phụ thuộc: %s

source: Unsatisfied dependency
vi: Quan hệ phụ thuộc chưa chắc chắn

source: Matched from:
vi: Đã khớp từ:

source: License : %s
vi: Giấy phép : %s

source: Filename : %s
vi: Tên tập tin : %s

source: Provides :
vi: Cung cấp :

source: Other :
vi: Khác :

source: There was an error calculating total download size
vi: Có lỗi xảy ra khi tính tổng kích thước tải về

source: Total size: %s
vi: Tổng kích thước: %s

source: Total download size: %s
vi: Kích thước tải về tổng cộng: %s

source: Installed size: %s
vi: Kích thước cần để cài đặt: %s

source: There was an error calculating installed size
vi: Có lỗi xảy ra khi tính toán kích cỡ đĩa cần để cài

source: Installing for group upgrade "%s"
vi: Đang cài đăt cho nhóm nâng cấp “%s”

source: Installing for group install "%s"
vi: Đang cài đăt cho nhóm cài đặt “%s”

source: Reinstalling
vi: Đang cài đặt lại

source: Downgrading
vi: Đang hạ cấp

source: Installing for dependencies
vi: Đang cài đặt phần phụ thuộc

source: Updating for dependencies
vi: Đang cập nhật phần phụ thuộc

source: Removing for dependencies
vi: Đang gỡ bỏ phần phụ thuộc

source: Skipped (dependency problems)
vi: Bỏ qua (gặp vấn đề về quan hệ phụ thuộc)

source: Not installed
vi: Chưa cài đặt

source: Not available
vi: Không sẵn sang

source: Package
vi: Gói

source: Arch
vi: Kiến trúc

source: Version
vi: Phiên bản

source: Repository
vi: Kho chứa

source: Size
vi: Kích cỡ

source: replacing %s%s%s.%s %s
vi: đang thay thế %s%s%s.%s %s

source: Transaction Summary %s
vi: Tóm tắt giao dịch %s

source: Install
vi: Cài đặt

source: Upgrade
vi: Nâng cấp

source: Remove
vi: Gỡ bỏ

source: Reinstall
vi: Cài đặt lại

source: Downgrade
vi: Hạ cấp

source: Dependent package
vi: Các gói phụ thuộc

source: Removed
vi: Bị gỡ bỏ

source: Dependency Removed
vi: Đã gỡ bỏ phần phụ thuộc

source: Dependency Installed
vi: Đã cài đặt phần phụ thuộc

source: Dependency Updated
vi: Đã cập nhật phần phụ thuộc

source: Replaced
vi: Bị thay thế

source: Failed
vi: Thất bại

source: two
vi: hai

source: Current download cancelled, %sinterrupt (ctrl-c) again%s within %s%s%s seconds to exit.
vi: Việc tải về hiện hành đã bị hủy bỏ, %s ngắt (ctrl-c) lần nữa%s trong %s%s%s giây to exit.

source: user interrupt
vi: ngắt người dùng

source: Total
vi: Tổng cộng

source: <unset>
vi: <hủy đặt>

source: System
vi: Hệ thống

source: Skipping merged transaction %d to %d, as it overlaps
vi: Bỏ qua giao dịch %d hòa trộn vào %d, như là nó chồng lên nhau

source: No transactions
vi: Không có giao dịch

source: Bad transaction IDs, or package(s), given
vi: Mã số giao dịch, hoặc (các) gói đã cho sai

source: Command line
vi: Dòng lệnh

source: Login user
vi: Người đăng nhập

source: Date and time
vi: Ngày giờ

source: Action(s)
vi: Thao tác

source: Altered
vi: Đã sửa đổi

source: No transaction ID given
vi: Chưa đưa ra mã số giao dịch

source: Bad transaction ID given
vi: Đưa ra mã số giao dịch sai

source: Not found given transaction ID
vi: Không tìm thấy giao dịch có mã số đã cho

source: Found more than one transaction ID!
vi: Tìm thấy nhiều hơn một giao dịch có mã số đã cho!

source: No transaction ID, or package, given
vi: Chưa đưa ra mã số giao dịch, hay gói

source: Downgraded
vi: Đã hạ cấp

source: Older
vi: Cũ hơn

source: Newer
vi: Mới hơn

source: Transaction ID :
vi: Mã số giao dịch:

source: Begin time :
vi: Thời điểm bắt đầu:

source: Begin rpmdb :
vi: Bắt đầu rpmdb:

source: (%u seconds)
vi: (%u giây)

source: (%u minutes)
vi: (%u phút)

source: (%u hours)
vi: (%u giờ)

source: (%u days)
vi: (%u ngày)

source: End time :
vi: Thời điểm cuối :

source: End rpmdb :
vi: Kết thúc rpmdb:

source: User :
vi: Người dùng :

source: Return-Code :
vi: Mã trả về :

source: Aborted
vi: Bị bỏ dở

source: Failures:
vi: Thất bại:

source: Failure:
vi: Thất bại:

source: Success
vi: Thành công

source: Command Line :
vi: Dòng lệnh :

source: Additional non-default information stored: %d
vi: Thông tin không mặc định bổ xung được lưu: %d

source: Transaction performed with:
vi: Giao dịch thực hiện với:

source: Packages Altered:
vi: Các gói đã thay đổi:

source: Packages Skipped:
vi: Các gói bị bỏ qua:

source: Rpmdb Problems:
vi: Vấn đề với CSDL rpm:

source: Scriptlet output:
vi: Kết xuất Scriptlet:

source: Errors:
vi: Lỗi:

source: Dep-Install
vi: Cài-Đặt-Phần-Phụ-Thuộc

source: Obsoleting
vi: Đã lạc hậu

source: Erase
vi: Tẩy

source: Update
vi: Cập nhật

source: Time
vi: Thời gian

source: Last day
vi: Ngày cuối

source: Last week
vi: Tuần cuối

source: Last 2 weeks
vi: 2 tháng cuối

source: Last 3 months
vi: 3 tháng cuối

source: Last 6 months
vi: 6 tháng cuối

source: Last year
vi: Năm cuối

source: Over a year ago
vi: Hơn một năm trước

source: No Transaction %s found
vi: Không tìm thấy giao dịch %s

source: Transaction ID:
vi: Mã số giao dịch:

source: Available additional history information:
vi: Thông tin lịch sử phụ thêm sẵn có:

source: %s: No additional data found by this name
vi: %s: Không tìm thấy dữ liệu thêm nào cho tên này

source: Package :
vi: Gói :

source: State :
vi: Tình trạng :

source: Size :
vi: Cỡ :

source: Build host :
vi: Máy dịch :

source: Build time :
vi: Lúc biên dịch :

source: Packager :
vi: Người đóng gói :

source: Vendor :
vi: Nhà cung cấp :

source: License :
vi: Giấy phép :

source: Source RPM :
vi: Gói nguồn RPM :

source: Commit Time :
vi: Thời điểm chuyển giao:

source: Committer :
vi: Người chuyển giao :

source: Reason :
vi: Lý do :

source: From repo :
vi: Từ kho :

source: Installed by :
vi: Được cài đặt bởi :

source: Changed by :
vi: Thay đổi bởi :

source: Error: %s
vi: Lỗi: %s

source: installed
vi: đã cài đặt

source: an update
vi: một cập nhật

source: erased
vi: được xóa

source: reinstalled
vi: được cài đặt lại

source: a downgrade
vi: một hạ cấp

source: obsoleting
vi: đã cũ

source: updated
vi: đã cập nhật

source: obsoleted
vi: đã cũ

source: ---> Package %s.%s %s:%s-%s will be %s
vi: ---> Gói %s.%s %s:%s-%s sẽ %s

source: --> Running transaction check
vi: --> Đang chạy kiểm tra giao dịch

source: --> Restarting Dependency Resolution with new changes.
vi: --> Đang khởi động lại phân giải quan hệ phụ thuộc với các thay đổi mới.

source: --> Finished Dependency Resolution
vi: --> Đã hoàn tất phân giải quan hệ phụ thuộc

source: --> Processing Dependency: %s for package: %s
vi: --> Đang xử lý quan hệ phụ thuộc: %s cho gói: %s

source: ---> Keeping package: %s due to %s
vi: ---> Giữ lại gói: %s bởi vì %s

source: --> Unresolved Dependency: %s
vi: --> Không thể giải quyết ra quan hệ phụ thuộc: %s

source: Package: %s
vi: Gói: %s

source: Requires: %s
vi: Cần : %s

source: Not found
vi: Không tìm thấy

source: Updated By
vi: Được cập nhật bởi

source: Downgraded By
vi: Bị hạ cấp bới

source: Obsoleted By
vi: Cũ do

source: Available
vi: Sẵn sàng

source: --> Processing Conflict: %s conflicts %s
vi: --> Đang xử lý xung đột: %s xung đột %s

source: --> Populating transaction set with selected packages. Please wait.
vi: --> Đi đến tập hợp giao dịch với các gói đã chọn. Vui lòng chờ.

source: ---> Downloading header for %s to pack into transaction set.
vi: ---> Đang tải phần đầu cho %s để gói vào một tập hợp giao dịch.

source: Verifying
vi: Thẩm tra

source: Running
vi: Đang chạy

source: Sleeping
vi: Đang ngủ

source: Uninterruptible
vi: Không thể ngắt

source: Zombie
vi: Ma

source: Traced/Stopped
vi: Theo dõi / Dừng

source: Unknown
vi: Không rõ

source: The other application is: PackageKit
vi: Ứng dụng khác là: PackageKit

source: The other application is: %s
vi: Ứng dụng khác là: %s

source: Memory : %5s RSS (%5sB VSZ)
vi: Bộ nhớ : %5s RSS (%5sB VSZ)

source: Started: %s - %s ago
vi: Khởi chạy: %s - %s trước

source: State : %s, pid: %d
vi: Trạng thái: %s, pid: %d

source: Exiting on user cancel
vi: Thoát ra do người dùng hủy thao tác

source: Exiting on Broken Pipe
vi: Thoát ra do đường ống dẫn lệnh hỏng

source: Config Error: %s
vi: Lỗi cấu hình: %s

source: Options Error: %s
vi: Lỗi tùy chọn: %s

source: PluginExit Error: %s
vi: Lỗi PluginExit: %s

source: Yum Error: %s
vi: Lỗi Yum: %s

source: You could try using --skip-broken to work around the problem
vi: Bạn có thể thử dùng --skip-broken để sửa vấn đề này

source: You could try running: rpm -Va --nofiles --nodigest
vi: Bạn nên chạy: rpm -Va --nofiles --nodigest

source: Unknown Error(s): Exit Code: %d:
vi: Lỗi chưa biết: Mã thoát: %d:

source: Dependencies Resolved
vi: Đã phân giải các thành phần phụ thuộc

source: Complete!
vi: Hoàn thành!

source: Mini usage:
vi: Cách dùng dạng giản lược:

source: You need to be root to perform this command.
vi: Bạn cần phải thực hiện lệnh này dưới quyền siêu quản trị

source: You have enabled checking of packages via GPG keys. This is a good thing. However, you do not have any GPG public keys installed. You need to download the keys for packages you wish to install and install them. You can do that by running the command: rpm --import public.gpg.key Alternatively you can specify the url to the key you would like to use for a repository in the 'gpgkey' option in a repository section and yum will install it for you. For more information contact your distribution or package provider.
vi: Bạn phải bật kiểm tra gói thông qua khóa GPG. Đây là một thứ tốt. Tuy nhiên, bạn không có bất kỳ khóa GPG công nào được cài đặt. Bạn cần tải những khóa dành cho những gói muốn cài và cài đặt chúng. Bạn có thể thực hiện điều này bằng cách chạy lệnh: rpm --import public.gpg.key Một cách khác là bạn có thể chỉ định url đến khóa bạn muốn dùng cho kho trong tùy chọn “gpgkey” trong phần kho và yum sẽ cài đặt nó cho bạn. Để có thêm thông tin vui lòng liên hệ với bản phân phối của bạn hoặc người cung cấp gói.

source: Problem repository: %s
vi: Có vấn đề với kho chứa: %s

source: Error: Need to pass a list of pkgs to %s
vi: Lỗi: Cần chuyển một danh sách pkgs cho %s

source: Error: Need at least two packages to %s
vi: Lỗi: Cần ít nhất hai gói cho %s
