Repository: vitalikp/yum
Catalog: po/*.po
Languages: vi

source: %s was supposed to be removed but is not!
vi: %s được coi là đã được gỡ bỏ nhưng không phải vậy!

source: Existing lock %s: another copy is running as pid %s.
vi: Đã có khóa %s: bản sao khác đã chạy với mã số tiến trình %s.

source: Could not create lock at %s: %s
vi: Không thể tạo khóa tại %s: %s

source: Could not open lock %s: %s
vi: Không thể mở khóa %s: %s

source: Unable to check if PID %s is active
vi: Không thể kiểm tra nếu PID của %s đang hoạt động

source: Could not perform checksum
vi: Không thể thực hiện tổng kiểm tra

source: Package does not match checksum
vi: Gói không khớp mã tổng kiểm tra

source: ignoring a dupe of %s
vi: bỏ qua bản sự trùng lặp của %s

source: using local copy of %s
vi: đang dùng bản sao nội bộ của %s

source: package fails checksum but caching is enabled for %s
vi: tổng kiểm gói không đạt nhưng mà bộ nhớ tạm được bật cho %s

source: Delta RPMs reduced %s of updates to %s (%d%% saved)
vi: Delta RPMs giảm %s cập nhật xuống thành %s (%d%% được ghi lại)

source: Some delta RPMs failed to download or rebuild. Retrying..
vi: Một số RPMs delta gặp lỗi khi tải về hay biên dịch lại. Đang thử lại...

source: exiting because "Download Only" specified
vi: thoát ra bởi vì đã chỉ định "chỉ tải về"

source: Header is not complete.
vi: Phần đầu chưa hoàn thiện.

source: Header not in local cache and caching-only mode enabled. Cannot download %s
vi: Phần đầu trong bộ nhớ tạm nội bộ và chế độ chỉ nhớ tạm được bật. Không thể tải về %s

source: Public key for %s is not installed
vi: Khóa công cho %s chưa được cài đặt

source: Problem opening package %s
vi: Gặp lỗi khi mở gói %s

source: Public key for %s is not trusted
vi: Khóa công cho %s là không đáng tin

source: Package %s is not signed
vi: Gói %s chưa được ký

source: Cannot remove %s
vi: Không thể gỡ bỏ %s

source: %s removed
vi: Đã gỡ bỏ %s

source: Cannot remove %s file %s
vi: Không thể gỡ bỏ %s tập tin %s

source: %s file %s removed
vi: %s tập tin %s bị gỡ bỏ

source: %d %s file removed
vi: %d %s tập tin bị gỡ bỏ

source: More than one identical match in sack for %s
vi: Có nhiều hơn một khớp đúng trong sack dành cho %s

source: Nothing matches %s.%s %s:%s-%s from update
vi: Không có gì khớp với %s.%s %s:%s-%s từ cập nhật

source: searchPackages() will go away in a future version of Yum. Use searchGenerator() instead.
vi: searchPackages() sẽ ra đi trong phiên bản kế của Yum. Hãy dùng searchGenerator() để thay thế.

source: Searching %d package
vi: Đang tìm kiếm %d gói

source: searching package %s
vi: đang tìm gói %s

source: searching in file entries
vi: đang tìm trong các mục tin tập tin

source: searching in provides entries
vi: tìm kiếm trong toàn bộ nhóm cung cấp

source: No group data available for configured repositories
vi: Không có dữ liệu nhóm sẵn có nào cho các kho đã cấu hình

source: No Group named %s exists
vi: Không có Nhóm mang tên %s

source: package %s was not marked in group %s
vi: gói %s chưa được đánh dấu vào trong nhóm %s

source: No Environment named %s exists
vi: Không có biến môi trường mang tên %s

source: Skipping package %s from group %s
vi: Bỏ qua nhóm %s từ nhóm %s

source: Adding package %s from group %s
vi: Thêm gói %s từ nhóm %s

source: No package named %s available to be installed
vi: Không có gói mang tên %s sẵn có để mà cài đặt

source: Warning: Group %s does not have any packages to install.
vi: Cảnh báo: Nhóm %s không có gói nào để cài đặt.

source: Group %s does have %u conditional packages, which may get installed.
vi: Nhóm %s không có %u gói điều kiện, gái mà có lẽ cần cài đặt.

source: Skipping group %s from environment %s
vi: Bỏ qua nhóm %s từ môi trường %s

source: Package tuple %s could not be found in packagesack
vi: Không thể tìm thấy bản ghi về gói %s trong packagesack

source: Package tuple %s could not be found in rpmdb
vi: Không thể tìm thấy bản ghi về gói %s trong rpmdb

source: Invalid version flag from: %s
vi: Cờ phiên bản không hợp lệ từ: %s

source: No Package found for %s
vi: Không tìm thấy gói nào cho %s

source: Group %s does not exist.
vi: Nhóm %s không tồn tại.

source: Warning: %s
vi: Cảnh báo: %s

source: Warning: Environment Group %s does not exist.
vi: Cảnh báo: Nhóm Môi trường %s không tồn tại.

source: Package: %s - can't co-install with %s
vi: Gói: %s - không thể đồng cài đặt với %s

source: Package Object was not a package object instance
vi: Đối tượng Gói đã không phải là minh dụ đối tượng gói

source: Nothing specified to install
vi: Chưa chỉ định gì để cài đặt

source: Checking for virtual provide or file-provide for %s
vi: Đang kiểm tra cho người cung cấp ảo hay cung cấp tập tin cho %s

source: Package %s installed and not available
vi: Gói %s đã cài đặt và không sẵn có

source: No package(s) available to install
vi: Không có gói nào sẵn sàng để cài đặt

source: Package: %s - already in transaction set
vi: Gói: %s - đã sẵn có trong tập hợp giao dịch

source: Package %s is obsoleted by %s which is already installed
vi: Gói %s đã lạc hậu do %s cái mà đã được cài đặt rồi

source: Package %s is obsoleted by %s, but obsoleting package does not provide for requirements
vi: Gói %s đã lạc hậu do %s, nhưng mà gói cũ không cung cấp cho yêu cầu

source: Package %s is obsoleted by %s, trying to install %s instead
vi: Gói %s đã lạc hậu do %s, đang thử cài thay thế bằng %s

source: Package %s already installed and latest version
vi: Gói %s đã được cài đặt với phiên bản mới nhất

source: Package matching %s already installed. Checking for update.
vi: Gói %s đã được cài đặt. Đang kiểm tra phiên bản mới.

source: Updating Everything
vi: Đang cập nhật mọi thứ

source: Not Updating Package that is already obsoleted: %s.%s %s:%s-%s
vi: Không cập nhật gói mà nó đã lạc hậu: %s.%s %s:%s-%s

source: No Match for argument: %s
vi: không khớp cho đối số: %s

source: No package matched to upgrade: %s
vi: Không có gói nào cần nâng cấp: %s

source: Package is already obsoleted: %s.%s %s:%s-%s
vi: Gói đã cũ rồi: %s.%s %s:%s-%s

source: Not Updating Package that is obsoleted: %s
vi: Không cập nhật gói mà nó đã lạc hậu: %s

source: Not Updating Package that is already updated: %s.%s %s:%s-%s
vi: Không cập nhật gói mà nó đã cập nhật rồi: %s.%s %s:%s-%s

source: No package matched to remove: %s
vi: Không có gói khớp với cần gỡ bỏ: %s

source: Skipping the running kernel: %s
vi: Bỏ qua việc chạy hạt nhân: %s

source: Removing %s from the transaction
vi: Gỡ bỏ %s khỏi giao dịch

source: Cannot open: %s. Skipping.
vi: Không thể mở: %s. Bỏ qua.

source: Examining %s: %s
vi: Đang kiểm tra %s: %s

source: Cannot localinstall deltarpm: %s. Skipping.
vi: Không thể cài đặt nội bộ deltarpm: %s. Bỏ qua.

source: Cannot add package %s to transaction. Not a compatible architecture: %s
vi: Không thể thêm gói %s vào giao dịch. Kiến trúc không tương thích: %s

source: Cannot install package %s. It is obsoleted by installed package %s
vi: Không thể cài đặt gói %s. Nó bị lạc hậu do đã cài gói %s

source: Package %s not installed, cannot update it. Run yum install to install it instead.
vi: Gói %s chưa được cài đặt nên không thể cập nhật nó. Chạy “yum install” để cài đặt nó.

source: Package %s.%s not installed, cannot update it. Run yum install to install it instead.
vi: Gói %s.%s chưa được cài đặt nên không thể cập nhật nó. Chạy “yum install” để cài đặt nó.

source: Excluding %s
vi: Đang bao gồm %s

source: Marking %s to be installed
vi: Đánh dấu %s là đã cài đặt

source: Marking %s as an update to %s
vi: Đánh dấu %s là được cập nhật thành %s

source: %s: does not update installed package.
vi: %s: không thể cập nhật gói đã cài.

source: Cannot open file: %s. Skipping.
vi: Không thể mở tập tin: %s nên bỏ qua.

source: Problem in reinstall: no package matched to remove
vi: Gặp trục trặc khi cài lại: không có gói nào khớp với để mà gỡ bỏ

source: Problem in reinstall: no package %s matched to install
vi: Gặp trục trặc khi cài lại: không có gói nào khớp với %s để mà cài đặt

source: No package(s) available to downgrade
vi: Không có gói nào sẵn có để mà hạ cấp

source: Package %s is allowed multiple installs, skipping
vi: Gói %s là cho phép đa cài đặt, bỏ qua

source: No Match for available package: %s
vi: Không khớp với mọi gói sẵn có: %s

source: Only Upgrade available on package: %s
vi: Chỉ nâng cấp sẵn sàng trên gói: %s

source: Failed to downgrade: %s
vi: Gặp lỗi khi hạ cấp: %s

source: Failed to upgrade: %s
vi: Gặp lỗi khi cập nhật: %s

source: Retrieving key from %s
vi: Đang lấy khóa về từ %s

source: GPG key retrieval failed:
vi: Gặp lỗi khi tìm kiếm khóa GPG:

source: GPG key signature on key %s does not match CA Key for repo: %s
vi: Chữ ký GPG trên khóa %s không khớp với CA cho kho: %s

source: GPG key signature verified against CA Key(s)
vi: Xác thực chữ ký khóa GPG dựa vào Khóa CA

source: Invalid GPG Key from %s: %s
vi: Khóa GPG không hợp lệ từ %s: %s

source: GPG key parsing failed: key does not have value %s
vi: Gặp lỗi khi phân tích khóa GPG: khóa không có giá trị %s

source: Importing %s key 0x%s: Userid : "%s" Fingerprint: %s Package : %s (%s) From : %s
vi: Đang nhập khóa %s 0x%s: Mã số người dùng: "%s" Dấu vân tay : %s Gói : %s (%s) Từ : %s

source: Importing %s key 0x%s: Userid : "%s" Fingerprint: %s From : %s
vi: Đang nhập khóa %s 0x%s: Mã số người dùng: "%s" Dấu vân tay : %s Từ : %s

source: Failing package is: %s GPG Keys are configured as: %s
vi: Gói lỗi là: %s Khóa GPG được cấu hình là: %s

source: GPG key at %s (0x%s) is already installed
vi: Khóa GPG tại %s (0x%s) đã được cài rồi

source: Key import failed (code %d)
vi: Nhập vào khóa bị lỗi (mã lỗi %d)

source: Key imported successfully
vi: Khóa được nhập vào thành công

source: Didn't install any keys
vi: đã không cài khóa nào

source: The GPG keys listed for the "%s" repository are already installed but they are not correct for this package. Check that the correct key URLs are configured for this repository.
vi: Khóa GPG được liệt kê cho kho “%s” đã được cài đặt nhưng chúng lại không chính xác với gói này. Vui lòng kiểm tra xem URL của khóa được cấu hình cho kho này đã chính xác chưa.

source: Import of key(s) didn't help, wrong key(s)?
vi: Việc nhập khóa không giúp được gì, khóa sai hả?

source: No
vi: Không

source: Yes
vi: Có

source: CA Key: %s Failing repo is: %s GPG Keys are configured as: %s
vi: Khóa CA: %s Kho lỗi là: %s Khóa GPG đã cấu hình là: %s

source: GPG key at %s (0x%s) is already imported
vi: Khóa GPG tại %s (0x%s) đã được nhập vào rồi

source: Key %s import failed
vi: Nhập vào khóa %s gặp lỗi

source: Didn't install any keys for repo %s
vi: Chưa cài đặt khóa nào cho kho %s

source: The GPG keys listed for the "%s" repository are already installed but they are not correct. Check that the correct key URLs are configured for this repository.
vi: Khóa GPG được liệt kê cho kho “%s” đã được cài đặt nhưng chúng lại không chính xác. Vui lòng kiểm tra xem URL của khóa được cấu hình cho kho này đã chính xác chưa.

source: Unable to find a suitable mirror.
vi: Không thể tìm thấy máy chứa bản sao thích hợp.

source: Errors were encountered while downloading packages.
vi: Đã có lỗi xảy ra trong khi đang tải các gói.

source: Running Transaction Check
vi: Đang chạy kiểm tra giao dịch

source: Test Transaction Errors:
vi: Lỗi kiểm tra giao dịch:

source: Could not set cachedir: %s
vi: Không thể đặt cachedir: %s

source: Dependencies not solved. Will not save unresolved transaction.
vi: Phần phụ thuộc chưa được phân giải. Sẽ không thể ghi lại giao dịch chưa phân giải.

source: Could not save transaction file %s: %s
vi: Không thể ghi lại tập tin giao dịch %s: %s

source: File is empty.
vi: Tập tin rỗng.

source: Could not access/read saved transaction %s : %s
vi: Không thể truy cập hoặc đọc giao dịch đã lưu %s : %s

source: rpmdb ver mismatched saved transaction version,
vi: phiên bản rpmdb không khớp với phiên bản được ghi trong giao dịch,

source: cannot find tsflags or tsflags not integer.
vi: không thể tìm thấy tsflags hoặc tsflags không phải số nguyên.

source: Found txmbr in unknown current state: %s
vi: Thấy txmbr trong trạng thái hiện tại không hiểu: %s

source: Could not find txmbr: %s in state %s
vi: Không thể tìm thấy txmbr: %s trong tình trạng %s

source: Could not find txmbr: %s from origin: %s
vi: Không thể tìm thấy txmbr: %s từ gốc: %s

source: Transaction members, relations are missing or ts has been modified,
vi: Thành viên giao dịch, quan hệ bị thiếu hoặc ts đã bị sửa đổi,

source: ignoring, as requested. You must redepsolve!
vi: đang bỏ qua, như theo yêu cầu. Bạn phải phân giải lại!

source: %s has been visited already and cannot be removed.
vi: %s đã được viếng thăm rồi và không thể bị gỡ bỏ.

source: Examining revdeps of %s
vi: Đang kiểm tra revdeps của %s

source: %s has revdep %s which was user-installed.
vi: %s có revdep %s cái là người cài đặt.

source: %s is needed by a package to be installed.
vi: %s là cần bởi một gói được cài đặt

source: %s has no user-installed revdeps.
vi: %s không có revdeps người dùng cài đặt.

source: Loaded plugins:
vi: Đã tải phần bổ xung:

source: No plugin match for: %s
vi: Không có phần bổ xung khớp với: %s

source: Not loading "%s" plugin, as it is disabled
vi: Không tải phần bổ xung “%s”, vì nó đã bị tắt

source: Plugin "%s" can't be imported
vi: Không thể nhập vào phần bổ xung “%s”

source: Plugin "%s" doesn't specify required API version
vi: Phần bổ xung “%s” không chỉ định phiên bản API mong muốn

source: Plugin "%s" requires API %s. Supported API is %s.
vi: Phần bổ xung “%s” yêu cầu API %s. Nhưng API hỗ trợ lại là %s.

source: Loading "%s" plugin
vi: Đang tải phần bổ xung "%s"

source: Two or more plugins with the name "%s" exist in the plugin search path
vi: Có hai hay hơn phần bổ xung có tên “%s” ở trong đường đường dẫn tìm kiếm phần bổ xung

source: Configuration file %s not found
vi: Không tìm thấy tập tin cấu hình %s

source: Unable to find configuration file for plugin %s
vi: Không thể tìm thấy tập tin cấu hình cho phần bổ xung %s

source: registration of commands not supported
vi: việc đăng ký các lệnh không được hỗ trợ

source: has missing requires of
vi: có các yêu cầu bị thiếu của

source: has installed conflicts
vi: có gói xung đột

source: %s is a duplicate with %s
vi: %s bị trùng với %s

source: %s is obsoleted by %s
vi: %s bị lạc hậu do %s

source: %s provides %s but it cannot be found
vi: %s cung cấp %s nhưng không thể tìm thấy nó

source: Repackaging
vi: Đóng gói lại

source: Verify: %u/%u: %s
vi: Thẩm tra: %u/%u: %s

source: Updateinfo file is not valid XML: %s
vi: Tập tin thông tin cập nhật không hợp chuẩn XML: %s

source: Insufficient space in download directory %s * free %s * needed %s
vi: Không đủ chỗ trống tại thư mục tải dữ liệu %s * còn trống %s * cần %s

source: Package does not match intended download.
vi: Gói không khớp với cái định tại về.

source: Header cannot be opened or does not match %s, %s.
vi: Phần đầu không thể được mở hoặc không khớp %s, %s.

source: RPM %s fails md5 check
vi: RPM %s kiểm tra md5 không đạt

source: Could not open RPM database for reading. Perhaps it is already in use?
vi: Không thể mở cơ sở dữ liệu RPM để đọc. Có lẽ nó đang được dùng?

source: Got an empty Header, something has gone wrong
vi: Nhận được phần đầu trống rỗn, đã có gì đó sai rồi

source: Damaged Header %s
vi: Phần đầu Hỏng %s

source: Error opening rpm %s - error %s
vi: Lỗi mở rpm %s - lỗi %s
