Repository: vitalikp/yum
Catalog: po/*.po
Languages: vi

source: Error: Need to pass a single valid repoid. to %s
vi: Lỗi: Cần chuyển một mã số kho hợp lệ đơn vào %s

source: Error: Need to pass only a single valid repoid. to %s, passed: %s
vi: Lỗi: Cần chuyển chỉ một mã kho đơn hợp lệ cho %s, đã chuyển: %s

source: Repo %s has been automatically enabled.
vi: Kho %s được tự động bật.

source: Error: Need an item to match
vi: Lỗi: Cần một mục khớp mẫu

source: Error: Need a group or list of groups
vi: Lỗi: Cần một nhóm hay danh sách các nhóm

source: Error: clean requires an option: %s
vi: Lỗi: dọn dẹp cần một tùy chọn: %s

source: Error: invalid clean argument: %r
vi: Lỗi: đối số dọn dẹp không hợp lệ: %r

source: No argument to shell
vi: Không có đối số cho hệ vỏ

source: Filename passed to shell: %s
vi: Tên tập tin chuyển sang hệ vỏ: %s

source: File %s given as argument to shell does not exist.
vi: Tập tin %s đưa ra nhưng là tham số cho hệ vỏ không tồn tại.

source: Error: more than one file given as argument to shell.
vi: Lỗi: đã cho nhiều hơn một tập tin làm đối số cho hệ vỏ.

source: PACKAGE...
vi: GÓI...

source: Install a package or packages on your system
vi: Cài đặt một hay nhiều gói lên hệ thống của bạn

source: Setting up Install Process
vi: Đang cài đặt Tiến trình Cài đặt

source: [PACKAGE...]
vi: [GÓI...]

source: Update a package or packages on your system
vi: Cập nhật một hay nhiều gói trên hệ thống của bạn

source: Setting up Update Process
vi: Đang cài đặt Tiến trình Cập nhật

source: Synchronize installed packages to the latest available versions
vi: Đồng bộ hóa các gói đã cài với phiên bản mới nhất sẵn có

source: Setting up Distribution Synchronization Process
vi: Đang cài đặt Xử lý Đồng bộ bản phân phối

source: Display details about a package or group of packages
vi: Hiển thị chi tiết về một gói hay một nhóm gói

source: Installed Packages
vi: Các gói đã cài

source: Available Packages
vi: Các gói sẵn sàng

source: Extra Packages
vi: Các gói mở rộng

source: Updated Packages
vi: Các gói đã cập nhật

source: Obsoleting Packages
vi: Các gói đã lỗi thời

source: Recently Added Packages
vi: Các gói mới thêm

source: No matching Packages to list
vi: Không có gói nào khớp với danh sách

source: List a package or groups of packages
vi: Liệt kê một gói hay nhóm của gói

source: Remove a package or packages from your system
vi: Gỡ bỏ một hay nhiều gói phần mềm từ hệ thống của bạn

source: Setting up Remove Process
vi: Đang cài đặt Tiến trình Gỡ bỏ

source: Remove leaf packages
vi: Xóa các gói cành lá

source: Display, or use, the groups information
vi: Hiển thị, hoặc dùng, thông tin nhóm

source: Setting up Group Process
vi: Đang cài đặt Tiến trình Nhóm

source: No Groups on which to run command
vi: Không có nhóm để chạy lệnh

source: Invalid groups sub-command, use: %s.
vi: Lệnh-con nhóm không hợp lệ, dùng: %s.

source: There is no installed groups file.
vi: Không có tập tin các nhóm được cài.

source: Maybe run: yum groups mark convert (see man yum)
vi: Có lẽ nên chạy: yum groups mark convert (xem yum(1))

source: You don't have access to the groups DBs.
vi: Bạn không có quyền truy cập vào Cơ sở dữ liệu nhóm.

source: You don't have access to the groups DB.
vi: Bạn không có quyền truy cập vào Cơ sở dữ liệu nhóm.

source: Generate the metadata cache
vi: Tạo bộ nhớ đệm metadata

source: Making cache files for all metadata files.
vi: Tạo tập tin dữ liệu nhớ tạm cho mọi tập tin siêu dữ liệu.

source: This may take a while depending on the speed of this computer
vi: Lệnh này cần thời gian phụ thuộc vào tốc độ của máy tính này

source: Metadata Cache Created
vi: Bộ đệm Siêu dữ liệu đã được tạo

source: Remove cached data
vi: Gỡ bỏ dữ liệu nhớ đệm

source: Find what package provides the given value
vi: Tìm gói nào cung cấp giá trị đã cho

source: Check for available package updates
vi: Kiểm tra xem có gói cập nhật nào không

source: Search package details for the given string
vi: Tìm thông tin chi tiết gói cho giá trị đã cho

source: Searching Packages:
vi: Đang tìm các gói:

source: Update packages taking obsoletes into account
vi: Cập nhật các gói nhận những gói cũ vào tài khoản

source: Setting up Upgrade Process
vi: Đang cài đặt Tiến trình Nâng cấp

source: Install a local RPM
vi: Cài một RPM nội bộ

source: Setting up Local Package Process
vi: Đang cài đặt quá trình gói nội bộ

source: Searching Packages for Dependency:
vi: Đang tìm Các gói cho phần phụ thuộc:

source: Run an interactive yum shell
vi: Chạy hệ vỏ yum tương tác

source: Setting up Yum Shell
vi: Đang cài đặt hệ vỏ yum

source: List a package's dependencies
vi: Danh sách các phần phụ thuộc của gói

source: Finding dependencies:
vi: Tìm sự phụ thuộc:

source: Display the configured software repositories
vi: Hiển thị các kho phần mềm đã cấu hình

source: enabled
vi: đã bật

source: disabled
vi: đã tắt

source: Repo-id :
vi: id-kho :

source: Repo-name :
vi: Tên-kho :

source: Repo-status :
vi: Trạng-thái-kho:

source: Repo-revision:
vi: Phiên-bản-kho:

source: Repo-tags :
vi: Thẻ-kho :

source: Repo-distro-tags:
vi: Thẻ-kho-bản-phân-phối:

source: Repo-updated :
vi: Kho-đã-cập-nhật:

source: Repo-size :
vi: Cỡ-kho :

source: Repo-baseurl :
vi: URL-kho :

source: Updated :
vi: Đã được cập nhật:

source: Repo-mirrors :
vi: Ảnh-kho :

source: Never (last: %s)
vi: Chưa bao giờ (cuối: %s)

source: Instant (last: %s)
vi: Minh dụ (cuối: %s)

source: %s second(s) (last: %s)
vi: %s giây (cuối: %s)

source: Repo-expire :
vi: Kho-hết-hạn :

source: Repo-exclude :
vi: Kho-loại-trừ :

source: Repo-include :
vi: Kho-bao-gồm :

source: Repo-excluded:
vi: Kho-đã-loại-trừ:

source: Repo-filename:
vi: Tập-tin-kho :

source: repo id
vi: id kho

source: status
vi: trạng thái

source: repo name
vi: tên kho

source: Display a helpful usage message
vi: Hiển thị cách dùng hữu dụng

source: No help available for %s
vi: Không có trợ giúp nào sẵn sàng cho “%s”

source: aliases:
vi: bí danh:

source: alias:
vi: bí danh:

source: Setting up Reinstall Process
vi: Đang cài đặt Tiến trình cài LẠI

source: reinstall a package
vi: cài lại một gói

source: Setting up Downgrade Process
vi: Đang cài đặt Tiến trình Hạ cấp

source: downgrade a package
vi: hạ cấp một gói

source: Display a version for the machine and/or available repos.
vi: Hiển thị phiên bản cho máy và/hoặc các kho phần mềm sẵn có.

source: Yum version groups:
vi: Nhóm phiên bản Yum:

source: Group :
vi: Nhóm :

source: Packages:
vi: Các gói :

source: File doesn't exist: %s
vi: Tập tin không tồn tại: %s

source: Installed:
vi: Đã cài:

source: Group-Installed:
vi: Nhóm-Đã-Cài:

source: Available:
vi: Hiện có :

source: Group-Available:
vi: Nhóm-Sẵn-Có:

source: Display, or use, the transaction history
vi: Hiển thị hay dùng lịch sử giao dịch

source: Transactions:
vi: Giao dịch :

source: could not open history file: %s
vi: không thể mở tập tin lịch sử: %s

source: Begin time :
vi: Lúc bắt đầu :

source: End time :
vi: Thời gian cuối:

source: Counts :
vi: Số lượng :

source: yum DB :
vi: CSDL yum:

source: Invalid history sub-command, use: %s.
vi: Lệnh-con lịch sử không hợp lệ, dùng: %s.

source: You don't have access to the history DB.
vi: Bạn không có quyền truy cập vào CSDL lịch sử.

source: Check for problems in the rpmdb
vi: Kiểm tra trục trặc trong rpmdb

source: load a saved transaction from filename
vi: tải một giao địch đã lưu từ tên tập tin

source: showing transaction files from %s
vi: hiển thị các tập tin giao dịch từ %s

source: Filename
vi: Tên tập tin

source: Saved transactions from %s; looked at %u files
vi: Các giao dịch đã lưu lại từ %s; nhìn vào %u tập tin

source: loading transaction from %s
vi: đang tải giao dịch từ %s

source: Transaction loaded from %s with %s members
vi: Giao dịch được tải từ %s với thành viên %s

source: Simple way to swap packages, instead of using shell
vi: Cách đơn giản để tráo đổi các gói, thay vì dùng hệ vỏ

source: Treat a repo. as a group of packages, so we can install/remove all of them
vi: Coi một kho là một nhóm gói, và có thể cài/gỡ bỏ tất cả chúng

source: Error: Need to pass a repoid. and command to %s
vi: Lỗi: cần chuyển qua một mã số kho và lệnh đến %s

source: %d package to update
vi: %d gói được cập nhật

source: %d package to move to
vi: %d gói được chuyển tới

source: %d package to remove/reinstall
vi: %d gói bị gỡ bỏ hay cài đặt lại

source: %d package to remove/sync
vi: %d gói được gỡ bỏ hay đồng bộ

source: Not a valid sub-command of %s
vi: Không phải là lệnh con hợp lệ của %s

source: Works like upgrade, but goes to the 'newest' package match which fixes a problem that affects your system
vi: Làm việc như là nâng cấp, nhưng tới gói “mới nhất” khớp với những cái đã sửa chữa trục trặc mà có ảnh hưởng đến hệ thống của bạn

source: Creates filesystem snapshots, or lists/deletes current snapshots.
vi: Tạo bản chụp của hệ thống tập tin, hoặc liệt kê hay xóa bản chụp hiện tại

source: Snapshot
vi: Bản chụp

source: Origin
vi: Gốc

source: Used
vi: Dùng

source: Free
vi: Trống

source: Tags
vi: Thẻ

source: List of %u snapshosts:
vi: Liệt kê %u bản chụp:

source: Deleted %u snapshosts:
vi: Xóa %u bản chụp:

source: Space available to take a snapshot.
vi: Không đủ chỗ trống để tạo bản chụp.

source: Failed to create snapshots
vi: Gặp lỗi khi tạo bản chụp

source: Created snapshot from %s, results is: %s
vi: Tạo bản chụp từ %s, kết quả là: %s

source: No snapshots, LVM version:
vi: Không có bản chụp, LVM phiên bản:

source: Have %u snapshots, using %s space, from %u origins.
vi: Có %u bản chụp, dùng %s đĩa, từ %u gốc.

source: Acts on the filesystem data of the host, mainly for removing docs/lanuages for minimal hosts.
vi: Thực hiện trên dữ liệu hệ thống tập tin của máy chủ, chính là để gõ bỏ phần tài liệu và ngôn ngữ để tối giản cho máy chủ.

source: No such file or directory:
vi: Không có tập tin hoặc thư mục như vậy:

source: Ghost pkgs size :
vi: Cỡ pkgs Ma :

source: Not pkgs size :
vi: Cỡ pkgs Không:

source: Miss pkgs size :
vi: Cỡ pkgs Thiếu:

source: Mod. pkgs size :
vi: Cỡ gói sửa:

source: Data size :
vi: Kích cỡ dữ liệu:

source: Ghost Pkgs :
vi: Pkgs Ma :

source: Not Pkgs :
vi: Pkgs Không:

source: Miss. Pkgs :
vi: Pkgs Thiếu:

source: Mod. Pkgs :
vi: Gói sửa : %s

source: Top %d packages:
vi: Top %d gói:

source: Top %d ghost packages:
vi: Top %d gói ma:

source: Top %d not. packages:
vi: Top %d không gói:

source: Top %d miss packages:
vi: Top %d gói thiếu:

source: Top %d mod. packages:
vi: Top %d gói sửa:

source: Top %d prefix packages:
vi: Top %d gói tiền tố:

source: Top %d non-package files:
vi: Top %d tập tin không phải gói:

source: File system filters:
vi: Các bộ lọc hệ thống tập tin:

source: Nodocs:
vi: Không tài liệu:

source: Languages:
vi: Ngôn ngữ:

source: Already enabled documentation filter.
vi: Đã bật sẵn bộ lọc tài liệu.

source: Already disabled documentation filter.
vi: Đã tắt sẵn bộ lọc tài liệu.

source: Enabling documentation filter.
vi: Bật bộ lọc tài liệu.

source: Disabling documentation filter.
vi: Tắt bộ lọc tài liệu.

source: Already filtering languages to: %s
vi: Đã sẵn lọc dữ liệu thành: %s

source: Already disabled language filter.
vi: Các bộ lọc ngôn ngữ sẵn bị tắt.

source: Setting language filter to: %s
vi: Đang đặt lọc ngôn ngữ thành: %s

source: Disabling language filter.
vi: Tắt bộ lọc ngôn ngữ.

source: Not a valid sub-command of fs filter
vi: Không phải là lệnh con hợp lệ cho bộ lọc fs

source: No valid packages: %s
vi: Không phải là gói hợp lệ : %s

source: Removing:
vi: Đang gỡ bỏ:

source: Not installed:
vi: Chưa cài đặt:

source: Not packaged?:
vi: Chưa được đóng gói?:

source: Can't find diff command
vi: Không thể tìm thấy lệnh diff

source: Can't find cpio command
vi: Không thể tìm thấy lệnh cpio

source: Can't find rpm2cpio command
vi: Không thể tìm thấy lệnh rpm2cpio

source: Can't find package: %s
vi: Không thể tìm thấy gói: %s

source: Modified:
vi: Đã sửa:

source: Yum checks failed: %s
vi: Gặp lỗi khi yum kiểm tra: %s

source: No read/execute access in current directory, moving to /
vi: Không có quyền đọc/thực thi trong thư mục hiện tại, di chuyển vào /

source: No getcwd() access in current directory, moving to /
vi: Không có quyền đgetcwd() trong thư mục hiện tại, di chuyển vào /

source: Resolving Dependencies
vi: Đang phân giải các gói phụ thuộc

source: Your transaction was saved, rerun it with: yum load-transaction %s
vi: Giao dịch của bạn đã được ghi lại, chạy lại bằng lệnh: yum load-transaction %s

source: Exiting on user cancel.
vi: Thoát ra do người dùng hủy bỏ thao tác.

source: doTsSetup() will go away in a future version of Yum.
vi: doTsSetup() sẽ ra đi trong phiên bản tương lai của Yum.

source: Setting up TransactionSets before config class is up
vi: Đang cài đặt TransactionSets trước khi lớp cấu hình tới

source: Invalid tsflag in config file: %s
vi: tsflag không hợp lệ trong tập tin cấu hình: %s

source: Searching pkgSack for dep: %s
vi: Đang tìm kiếm pkgSack dành cho phần phụ thuộc: %s

source: Member: %s
vi: Thành viên: %s

source: %s converted to install
vi: %s được chuyển đổi để cài đặt

source: Adding Package %s in mode %s
vi: Thêm Gói %s trong chế độ %s

source: Removing Package %s
vi: Đang gỡ bỏ gói %s

source: %s requires: %s
vi: %s yêu cầu: %s

source: %s requires %s
vi: %s yêu cầu %s

source: Needed Require has already been looked up, cheating
vi: Yêu cầu cần đã được tìm thấy, lừa đảo

source: Needed Require is not a package name. Looking up: %s
vi: Yêu cầu cần không phải là tên gói. Tìm kiếm: %s

source: Potential Provider: %s
vi: Nhà cung tiềm năng: %s

source: Mode is %s for provider of %s: %s
vi: Chế độ là %s cho người cung cấp %s: %s

source: Mode for pkg providing %s: %s
vi: Chế độ cho pkg cung cấp %s: %s

source: Trying to update %s to resolve dep
vi: Thử cập nhật %s để giải quyết quan hệ phụ thuộc

source: No update paths found for %s. Failure!
vi: Không tìm thấy đường dẫn cập nhật cho %s. Lỗi!

source: No update paths found for %s. Failure due to requirement: %s!
vi: Không tìm thấy đường dẫn cập nhật cho %s. Lỗi bởi vì yêu cần: %s!

source: Update for %s. Doesn't fix requirement: %s!
vi: Cập nhật cho %s. Không thể sửa các yêu cầu: %s!

source: TSINFO: %s package requiring %s marked as erase
vi: TSINFO: gói %s yêu cầu đánh dấu %s là tẩy

source: TSINFO: Obsoleting %s with %s to resolve dep.
vi: TSINFO: Đang dùng gói cũ %s với %s để mà giải quyết quan hệ phụ thuộc.

source: TSINFO: Updating %s to resolve dep.
vi: TSINFO: Đang cập nhật %s để giải quyết quan hệ phụ thuộc.

source: Cannot find an update path for dep for: %s
vi: Không thể tìm thấy đường dẫn cập nhật cho phụ thuộc cho: %s

source: Quick matched %s to require for %s
vi: Tìm nhanh %s để yêu cầu cho %s

source: %s is in providing packages but it is already installed, removing.
vi: %s là để cung cấp các gói, nhưng mà nó đã được cài đặt rồi, bỏ đi.

source: Potential resolving package %s has newer instance in ts.
vi: Có khả năng phân giải gói %s có minh dụ mới hơn trong ts.

source: Potential resolving package %s has newer instance installed.
vi: Có khả năng phân giải gói %s có minh dụ mới hơn đã cài.

source: %s already in ts, skipping this one
vi: %s đã sẵn trong ts, nên bỏ qua cái này

source: TSINFO: Marking %s as update for %s
vi: TSINFO: Đánh dấu %s là cập nhật cho %s

source: TSINFO: Marking %s as install for %s
vi: TSINFO: Đánh dấu %s là cài đặt cho %s

source: Success - empty transaction
vi: Thành công - giao dịch trống rỗng

source: Depsolving loop limit reached.
vi: Đã đạt đến ngưỡng giới hạn việc lặp phân giải phần phụ thuộc

source: Restarting Loop
vi: Đang khởi động lại vòng Lặp

source: Dependency Process ending
vi: Kết thúc Xử lý phần phụ thuộc

source: Success - deps resolved
vi: Thành công - đã giải quyết các thành phần phụ thuộc

source: Checking deps for %s
vi: Đang kiểm tra phụ thuộc cho %s

source: looking for %s as a requirement of %s
vi: đang tìm %s như theo yêu cầu của %s

source: Removing %s due to obsoletes from installed %s
vi: Đang gỡ bỏ %s nó đã lạc hậu do %s đã cài

source: Removing %s due to obsoletes from %s
vi: Đang gỡ bỏ %s vì cũ so với %s

source: Running compare_providers() for %s
vi: Đang chạy compare_providers() cho %s

source: better arch in po %s
vi: kiến trúc tốt hơn trong po %s

source: %s obsoletes %s
vi: %s cũ %s

source: archdist compared %s to %s on %s Winner: %s
vi: archdist đã so sánh %s với %s trên %s Chiến thắng: %s

source: common sourcerpm %s and %s
vi: sourcerpm chung %s và %s

source: base package %s is installed for %s
vi: gói cơ bản %s được cài đặt cho %s

source: common prefix of %s between %s and %s
vi: tiền tố chung của %s giữa %s và %s

source: provides vercmp: %s
vi: cung cấp vercmp: %s

source: Winner: %s
vi: Thắng: %s

source: requires minimal: %d
vi: yêu cầu tối thiểu: %d

source: Loser(with %d): %s
vi: Thua(với %d): %s

source: Best Order: %s
vi: Thứ tự tốt nhất: %s

source: doConfigSetup() will go away in a future version of Yum.
vi: doConfigSetup() sẽ ra đi trong phiên bản tương lai của Yum.

source: Skipping unreadable repository %s
vi: Bỏ qua kho không thể đọc được %s

source: Repository %r: Error parsing config: %s
vi: Kho %r: Lỗi phân tích cấu hình: %s

source: Repository %r is missing name in configuration, using id
vi: Kho %r thiếu tên trong cấu hình, đang dùng mã số

source: plugins already initialised
vi: các phần bổ xung đã được khởi tạo rồi

source: doRpmDBSetup() will go away in a future version of Yum.
vi: doRpmDBSetup() sẽ ra đi trong phiên bản kế của Yum.

source: Reading Local RPMDB
vi: Đang đọc cơ sở dữ liệu rpm nội bộ

source: doRepoSetup() will go away in a future version of Yum.
vi: doRepoSetup() sẽ bị bỏ đi trong phiên bản tương lai của Yum.

source: doSackSetup() will go away in a future version of Yum.
vi: doSackSetup() sẽ bị bỏ đi trong phiên bản tương lai của Yum.

source: Setting up Package Sacks
vi: Đang cài đặt Sack gói

source: repo object for repo %s lacks a _resetSack method
vi: đối tượng repo cho repo %s thiếu phương thức _resetSack

source: therefore this repo cannot be reset.
vi: bởi vậy kho này không thể bị đặt lại.

source: doUpdateSetup() will go away in a future version of Yum.
vi: doUpdateSetup() sẽ ra đi trong phiên bản kế của Yum.

source: Building updates object
vi: Đang xây dựng các cập nhật

source: doGroupSetup() will go away in a future version of Yum.
vi: doGroupSetup() sẽ ra đi trong phiên bản kế của Yum.

source: Getting group metadata
vi: Đang lấy siêu dữ liệu nhóm

source: Adding group file from repository: %s
vi: Đang thêm tập tin nhóm từ kho: %s

source: Failed to retrieve group file for repository: %s
vi: Gặp lỗi khi lấy tập tin nhóm cho kho: %s

source: Failed to add groups file for repository: %s - %s
vi: Gặp lỗi khi thêm tập tin nhóm cho kho: %s - %s

source: No Groups Available in any repository
vi: Chẳng có nhóm nào sẵn có trong mọi kho

source: Getting pkgtags metadata
vi: Đang lấy pkgtags metadata

source: Adding tags from repository: %s
vi: Thêm các thẻ từ kho: %s

source: Failed to add Pkg Tags for repository: %s - %s
vi: Gặp lỗi khi thêm Thẻ Pkg cho kho: %s - %s

source: Getting updateinfo metadata
vi: Đang lấy siêu dữ liệu thông tin cập nhật

source: Adding Update Info from repository: %s
vi: Thêm thông tin cập nhật từ kho: %s

source: Failed to add Update Info for repository: %s - %s
vi: Gặp lỗi khi thêm thông tin cập nhật cho kho: %s - %s

source: Importing additional filelist information
vi: Đang nhập thông tin danh sách tập tin phụ thêm

source: The program %s is found in the yum-utils package.
vi: Chương trình %s được tìm thấy trong gói yum-utils.

source: There are unfinished transactions remaining. You might consider running yum-complete-transaction, or "yum-complete-transaction --cleanup-only" and "yum history redo last", first to finish them. If those don't work you'll have to try removing/installing packages by hand (maybe package-cleanup can help).
vi: Có giao dịch chư hoàn tất còn lại. Bạn có lẽ nên cân nhắc chạy yum-complete-transaction, hay "yum-complete-transaction --cleanup-only" và "yum history redo last", trước để hoàn tất chúng. Nếu nó không làm việc bạn sẽ phải thử gỡ bỏ hoặc cài đặt các gói bằng tay (có lẽ lệnh package-cleanup sẽ giúp được bạn)

source: --> Finding unneeded leftover dependencies
vi: --> Đang tìm các phần phụ thuộc không cần còn lại

source: Protected multilib versions: %s != %s
vi: Phiên bản đa thư viện có bảo vệ: %s != %s

source: Multilib version problems found. This often means that the root cause is something else and multilib version checking is just pointing out that there is a problem. Eg.: 1. You have an upgrade for %(name)s which is missing some dependency that another package requires. Yum is trying to solve this by installing an older version of %(name)s of the different architecture. If you exclude the bad architecture yum will tell you what the root cause is (which package requires what). You can try redoing the upgrade with --exclude %(name)s.otherarch ... this should give you an error message showing the root cause of the problem. 2. You have multiple architectures of %(name)s installed, but yum can only see an upgrade for one of those architectures. If you don't want/need both architectures anymore then you can remove the one with the missing update and everything will work. 3. You have duplicate versions of %(name)s installed already. You can use "yum check" to get yum show these errors. ...you can also use --setopt=protected_multilib=false to remove this checking, however this is almost never the correct thing to do as something else is very likely to go wrong (often causing much more problems).
vi: Đã gặp vấn đề đa phiên bản thư viện. Điều này thường có nghĩa là nguyên nhân gốc là một cái gì đó khác, và việc kiểm tra đa phiên bản thư viện chỉ ra rằng đó là một trục trặc. Ví dụ: 1. Bạn nâng cấp cho %(name)s cái mà thiếu một số phần phụ thuộc, cái mà yêu cầu gói khác. Yum thì cố giải quyết đều này bằng cách cài các phiên bản cũ của %(name)s của một kiến trúc khác. Nếu bạn lại trừ kiến trúc sai yum sẽ nói với bạn nguyên nhân gốc là gì (gói nào yêu cầu cái gì). Bạn có thể thử thực hiện lại việc nâng cấp với --exclude %(name)s.otherarch ... nó cố thể đưa ra cho bạn một thông báo lỗi hiển thị nguyên nhân gốc của vấn đề. 2. Bạn có %(name)s đa kiến trúc đã cài đặt, nhưng yum chỉ có thể thấy một nâng cấp trong số những kiến trúc đó. Nếu bạn không muốn hay cần cả các kiến trúc đó nữa thì bạn có thể gỡ bỏ đi một cái thiếu cập nhật và mọi thứ sẽ lại hoạt động. 3. Bạn có các phiên bản cài đặt trùng lặp của %(name)s. Bạn có thể dùng "yum check" để yum hiển thị các lỗi. ...bạn còn có thể dùng --setopt=protected_multilib=false để gỡ bỏ kiểm tra này, tuy nhiên điều đó phần lớn là không đúng đắn vì nó làm cho các thứ khác trở thành lỗi (thường là nguyên nhân dẫn đến trục trặc hơn nữa).

source: Trying to remove "%s", which is protected
vi: Thử gỡ bỏ “%s”, cái mà được bảo vệ

source: Packages skipped because of dependency problems:
vi: Các gói bị bỏ qua bởi vì gặp trục trặc trong quan hệ phụ thuộc:

source: %s from %s
vi: %s từ %s

source: ** Found %d pre-existing rpmdb problem(s), 'yum check' output follows:
vi: ** Tìm thấy %d trục trặc đã xảy ra trước đó với rpmdb, “yum check” đã đưa ra những thông tin sau:

source: Warning: RPMDB altered outside of yum.
vi: Cảnh báo: RPMDB được cảnh báo ở ngoài yum.

source: missing requires
vi: thiếu yêu cầu

source: installed conflict
vi: xung đột đã cài

source: Warning: scriptlet or other non-fatal errors occurred during transaction.
vi: Cảnh báo: scriptlet hoặc lỗi không nghiêm trọng khác đã xảy ra trong quá trình giao dịch.

source: Transaction couldn't start:
vi: Giao dịch không thể khởi chạy:

source: Could not run transaction.
vi: Không thể chạy giao dịch.

source: Failed to remove transaction file %s
vi: Gặp lỗi khi gỡ bỏ tập tin giao dịch %s

source: %s was supposed to be installed but is not!
vi: %s được coi là đã cài đặt nhưng không phải vậy!
